Repository: SilviaCebrian/web_curriculum
Catalog: lib/l10n/app_*.arb
Languages: es

source: Home
es: Inicio

source: About me
es: Sobre mi

source: Projects
es: Proyectos

source: Contact
es: Contacto

# knowledgeText
source: Knowledge in :
es: Conocimientos en :

# knowledge_4
source: · Augmented Reality
es: · Realidad Aumentada

# knowledge_5
source: · Artificial Intelligence
es: · Inteligencia Artificial

# homeTabTitle
source: Senior Full Stack Programmer
es: Programadora Senior Full Stack

# homeTabSubtitle
source: Cross-platform application development, Mobile applications, Websites, Smart contracts.
es: Desarrollo de aplicaciones multiplataforma, Aplicaciones móviles, Webs, Smart contracts.

# yearsWorkingMultiText1
source: Years Working In multiple technologies
es: Años Trabajando En múltiples tecnologías

# yearsWorkingMultiText2
source: Years Working In multiple Technologies
es: Años Trabajando En múltiples Tecnologías

# experienceTitle
source: Great experience
es: Gran experiencia

# experienceSubtitle
source: Since I finished my studies in 2018, I have been working in different environments and projects.
es: Desde que terminé mis estudios en 2018, he estado trabajando en distintos entornos y proyectos.

# experienceEntry1Title
source: · In Unity » From 2018 - 2023
es: · En Unity » Desde 2018 - Actualidad.

# experienceEntry1Example1
source: App for integrating real toys into 2D/3D mini-games
es: Minijuegos 2D/3D con integración a juguetes reales.

# experienceEntry1Example2
source: Augmented Reality and Artificial Intelligence applications
es: Aplicaciones con Realidad Aumentada e Inteligencia Artificial.

# experienceEntry1Example3
source: Corporate projects
es: Proyectos para empresas.

# experienceEntry2Title
source: · In Flutter » From 2020 - Current
es: · En Flutter » Desde 2020 - Actualidad.

# experienceEntry2Example1
source: Mobile applications
es: Aplicaciones móviles

# experienceEntry2Example2
source: Websites
es: Páginas Web.

# experienceEntry3Title
source: · In Solidity » From 2021 - 2022
es: · En Solidity » Desde 2021 - Actualidad.

# experienceEntry3Example1
source: Own project with Smart Contracts of NFT game
es: Proyecto propio con Smart Contracts de juego NFT.

# otherKnowledge1Title
source: Languages
es: Idiomas

# otherKnowledge1Description
source: Native Spanish and valencian and basic english.
es: Español y Valenciano nativos, Inglés Básico.

# otherKnowledge2Title
source: Program Languages
es: Lenguajes

# otherKnowledge2Description
source: C#, Dart, Solidity and Javascript.
es: C#, Dart, Solidity, Javascript.

# otherKnowledge3Title
source: Environments
es: Entornos

# otherKnowledge3Description
source: Unity, Android Studio and Visual Studio Code.
es: Unity, Android Studio, Visual Studio Code.

# otherKnowledge4Title
source: Databases
es: Bases de Datos

# otherKnowledge5Description
source: SEO, Wordpress, Hosting, Domains and Cloudflare.
es: SEO, Wordpress, Hosting, Dominios, Cloudflare.

# otherKnowledge6Title
source: Augmented Reality
es: Realidad Aumentada

# otherKnowledge6Description
source: Vuforia AR, AR Core and AR Kit.
es: Vuforia AR, AR Core, AR Kit.

# otherKnowledge7Title
source: Artificial Intelligence
es: Inteligencia Artificial

# otherKnowledge7Description
source: Wit AI, Clarify, Google AI and Custom AIs.
es: Wit AI, Clarify, Google AI, Custom AIs.

# otherKnowledge8Description
source: Basic knowledge, Smart Contracts and Trading.
es: Conocimientos básicos, Smart Contracts, Trading.

# otherKnowledge9Title
source: Design
es: Diseño

# otherKnowledge9Description
source: Photoshop, Illustrator, music and video editing.
es: Photoshop, Illustrator, Edición videos y música.

# otherKnowledge10Description
source: For Discord, Blockchain and interaction with APIs.
es: Para Discord, Blockchain, interacción con APIs.

# tecnologiesText
source: · Technologies:
es: · Tecnologías:

# linksText
source: · Links:
es: · Enlaces:

# flutterContent1Title
source: · Shopping List Application 2020
es: · Aplicación Lista de la compra 2020

# flutterContent1Subtitle
source: App created to learn the basics of flutter. It uses providers, blocs, APIs, account creation ... It also served to learn how the Play Store works and SEO in applications.
es: Aplicación creada para aprender los conceptos básicos de flutter, se usan providers, bloc, APIs, creación de cuentas ... Además sirvió para aprender el funcionamiento de la Play Store y el SEO en aplicaciones.

# flutterContent1Tecnologies
source: Firebase - Facebook - X - Google Auth, Cloud Firestore, Firebase notifications, Admob, SQlite.
es: Firebase - Facebook - Twitter - Google Auth, Cloud Firestore, Firebase notifications, Admob, SQlite.

# flutterContent1Image1Title
source: List:
es: Lista:

# flutterContent1Image1Description
source: Simple listing with colors and icons to easily distinguish products for a more intuitive and quicker shopping experience.
es: Listado simple con colores e iconos para diferenciar fácilmente los productos para una compra más intuitiva y rápida.

# flutterContent1Image2Title
source: Categories:
es: Categorías predefinidas:

# flutterContent1Image2Description
source: It has predefined categories to save the user time, as well as to create new products.
es: Dispone de categorías predefinidas con las que ahorrar tiempo al usuario. También puede crear productos personalizados.

# flutterContent1Image3Title
source: Sharing:
es: Compartir:

# flutterContent1Image3Description
source: It has a system to share the list with other people who also have the app.
es: Dispone de un sistema con el que compartir la lista con otras personas que también dispongan de la app.

# flutterContent2Title
source: · Aiju Platform 2020 - 2023
es: · Plataforma Aiju 2020 - 2023

# flutterContent2Subtitle
source: Web that allows the integration of several artificial intelligences with applications of the platform users. This project is much more elaborate and it uses providers, apis and login system.
es: Web creada con la intención de integrar varios servicios de inteligencia artificial con aplicaciones reales o demostradores. Este proyecto está mucho más elaborado y en él si se usan providers, apis, inicio de sesión...

# flutterContent2UrlText1
source: Presentation of the project 2020
es: Presentación del proyecto 2020

# flutterContent2UrlText2
source: Presentation of the project 2021
es: Presentación del proyecto 2021

# flutterContent2UrlText3
source: Presentation of the project 2022-2023
es: Presentación del proyecto 2022 - Próximamente

# flutterContent2Image1Title
source: Login:
es: Inicio de sesión:

# flutterContent2Image1Description
source: The firebase auth and firebase database services are used to obtain login and user information.
es: Conexión con Firebase Auth para la creación de cuentas y con Firebase Database para obtener la información asociada a cada usuario.

# flutterContent2Image2Title
source: Initial menu:
es: Menú inicial:

# flutterContent2Image2Description
source: The user can choose to use artificial intelligence, visualize the data obtained in various applications or obtain information from the toys.
es: El usuario puede elegir entre usar la Inteligencia Artificial, visualizar los datos obtenidos en varias aplicaciones o obtener información de los juguetes.

# flutterContent2Image3Title
source: IAs menu:
es: Menú IAs:

# flutterContent2Image3Description
source: With four AIs to interact with. The user registers his application and can use them in his projects.
es: Aquí podemos elegir entre varias Ias con las que interaccionar. El usuario registra su aplicación y puede usarlas en sus proyectos.

# flutterContent2Image4Description
source: It allows to train the AI using expressions and intentions. For example, we can record actions such as exit, go or put and use them in an application.
es: Permite entrenar a la IA utilizando expresiones e intenciones. Por ejemplo podemos registrar acciones como salir, ir o poner y utilizarlas en una aplicación.

# flutterContent2Image5Title
source: Image interpretation:
es: Interpretación de imágenes:

# flutterContent2Image5Description
source: It allows the AI to be trained with customized images, for example to distinguish between dogs and cats or between different types of puzzles.
es: Permite entrenar a la IA con imágenes personalizadas, por ejemplo que diferencie entre perros y gatos o entre distintos tipos de puzzles...

# flutterContent2Image6Title
source: Recognition of feelings:
es: Reconocimiento de sentimientos:

# flutterContent2Image6Description
source: The AI interprets by a phrase or word whether the user conveys a positive/negative or neutral feeling.
es: La IA interpreta mediante una frase o una palabra si el usuario transmite un sentimiento positivo/negativo o neutral.

# flutterContent2Image7Title
source: Image recognition:
es: Reconocimiento de imágenes:

# flutterContent2Image7Description
source: The AI recognizes different entities in a photo and is able to tag them with high accuracy.
es: La IA reconoce distintas entidades en una foto y es capaz de etiquetarlas con una gran precisión.

# flutterContent2Image8Title
source: Data by application:
es: Datos por aplicación:

# flutterContent2Image8Description
source: Users register their applications on the platform and can visualize the data obtained through the App.
es: Los usuarios registran sus aplicaciones en la plataforma y pueden visualizar los datos suministrados por sus usuarios.

# flutterContent2Image9Title
source: Project structure:
es: Estructura del proyecto:

# flutterContent2Image9Description
source: A quick look at the structure, this project has its own widgets, providers and interaction with various APIs. The entire project has been designed and built by me.
es: Un vistazo rápido a la estructura, este proyecto cuenta con widgets propios, providers e interacción con varias APIs. Todo el proyecto ha sido diseñado y hecho por mi.

# flutterContent3Subtitle
source: Website created to show my job in a more visual way using the Flutter SDK. In it, I apply the knowledge acquired over the years in design techniques and translations.
es: Web creada para mostrar mi trabajo de una forma más visual usando flutter. En ella aplico los conocimientos adquiridos estos años. Aunque aquí realmente, es más diseño que otra cosa y es full responsive.

# flutterContent3Image1Title
source: Home:
es: Inicio:

# flutterContent3Image1Description
source: Simple home page to give a quick overview of the technologies I have been working with.
es: Portada simple para un vistazo rápido de las técnologias con las que he trabajado.

# flutterContent3Image2Title
source: About me:
es: Sobre mí:

# flutterContent3Image2Description
source: Information about my professional career and the knowledge I have acquired in different areas/technologies.
es: Información de mi carrera profesional, con mi trayectoria. Además de mis conocimientos sobre los distintos campos/tecnologías.

# flutterContent3Image3Title
source: Projects:
es: Proyectos:

# flutterContent3Image3Description
source: Summary list of my applications where the technologies used, links of interest and photos of the projects are specified.
es: Con un menú lateral para navegar sobre las tecnologias, en este apartado, muestro de forma visual en que consiste mi trabajo.

# unityContent7Subtitle
source: Application created for the famous game Intelect of the Falomir company. In it, an artificial intelligence is used to validate the words formed on the board and thus regulate the game. The app counts the points obtained by each player, changes the turn and ends the game if the conditions are met. Here I have only worked on the front end of the app.
es: Aplicación creada para el famoso juego Intelect de la empresa Falomir. En ella, se utiliza una inteligencia artificial para validar las palabras formadas en el tablero y regular así la partida. La app cuenta los puntos obtenidos por cada jugador, cambia el turno y finaliza la partida si las condiciones se cumplen. Aquí solamente he trabajado la parte front de la app.

# unityContent7UrlText1
source: App in the Play Store - Coming soon.
es: App en la Play Store - Próximamente.

# unityContent7Image1Title
source: Board Selection:
es: Selección Tablero:

# unityContent7Image1Description
source: The app allows you to select among the different boards available in the Intelect game.
es: La app permite seleccionar entre los distintos tableros de los que dispone el juego Intelect.

# unityContent7Image2Title
source: Data collection:
es: Recogida de datos:

# unityContent7Image2Description
source: By taking a photo of the board, the AI processes the letters on the board and verifies the word found with the RAE.
es: Mediante una foto al tablero, la IA procesa las letras que hay en él y verifica la palabra encontrada con la RAE.

# unityContent7Image3Title
source: IA Interpretation:
es: Interpretación IA:

# unityContent7Image3Description
source: Once the AI validates the word, the points are counted in the app. Allowing the user to enjoy the game without worrying about counting.
es: Una vez la IA válida la palabra, se contabilizan los puntos en la app. Permitiendo al usuario disfrutar del juego sin preocuparse por el conteo.

# unityContent6Subtitle
source: Simple application created in the pandemic to be able to visualize the fault created by the artist Dulk, since it could not be exhibited due to restrictions. It shows information about the author, the fault and illustrations that have served as a basis for creating it. In addition to being inspired by wild animals, the application contains a small breakdown of each of them with relevant information.
es: Aplicación sencilla creada en la pandemia para poder visualizar la falla creada por el artista Dulk, ya que no se podía exponer por las restricciones. En ella se muestra información sobre el autor, la falla e ilustraciones que han servido como base para crearla. Además al estar inspirada en animales salvajes, la aplicación contiene un pequeño desglose de cada uno, con información relevante.

# unityContent6Image1Description
source: The 'Falla' can be viewed in 2D as a drawing or using augmented reality to visualize the model in 3D.
es: La falla podemos verla en 2D a modo dibujo o usando realidad aumentada visualizando el modelo en 3D.

# unityContent6Image2Title
source: Art:
es: Arte:

# unityContent6Image2Description
source: The artist has been inspired by several animals to create the 'Falla', illustrated and captured in the app.
es: El artista se ha inspirado en varios animales para crear la falla, los ha ilustrado y plasmado en la app.

# unityContent6Image3Title
source: Information:
es: Información:

# unityContent6Image3Description
source: The animals chosen for the 'Falla' are endangered animals and the app talks about them and their problems.
es: Los animales elegidos para la falla, son animales en peligro de extinción y en la app se habla de ellos y de los problemas que tienen.

# unityContent5Title
source: · App study of emotions 2021
es: · App estudio de las emociones 2021

# unityContent5Subtitle
source: Application created to measure the user's emotions while playing the game. The game asks a series of questions created by a psychologist, while the user plays in a 2D scene. The application analyzes what the user says and interprets it, sending the processed information to a server. In addition, the application computes the user's predominant emotion while playing a game.
es: Aplicación creada para poder medir las emociones del usuario al jugar. El juego realiza una serie de preguntas creadas por un psicólogo, mientras el usuario juega en una escena 2D. La aplicación analiza lo que el usuario dice y lo interpreta, mandando la información procesada a un servidor. Además de sacar un cómputo global de la emoción predominante del usuario al jugar una partida.

# unityContent5Image1Title
source: Init:
es: Intro:

# unityContent5Image1Description
source: The game already asks the user how he/she is doing, although further analysis does not depend on the answer.
es: El juego ya pregunta al usuario como se encuentra, aunque el análisis posterior no depende de la respuesta.

# unityContent5Image2Title
source: Castle Game:
es: Juego Castillo:

# unityContent5Image2Description
source: The AI asks the user a variety of questions which unlock characters or parts of the scene, as well as mini-games.
es: La IA le hace una serie de preguntas al usuario las cuales van desbloqueando personajes o partes de la escena, así como minijuegos.

# unityContent5Image3Title
source: Game Tree:
es: Juego Árbol:

# unityContent5Image3Description
source: Same dynamics as the previous one, but with different scenery and mini-games.
es: La IA le hace una serie de preguntas al usuario las cuales van desbloqueando personajes o partes de la escena, así como minijuegos.

# unityContent4Subtitle
source: Simple application that allows you to take videos and photos of 3D objects using Augmented Reality. It has many animated models and resources with which the user can create fun and dynamic moments.
es: Aplicación sencilla, que permite hacer videos y fotos con objetos 3D usando la Realidad Aumentada. Dispone de muchos modelos animados y recursos, con los que el usuario podrá crear momentos divertidos y dinámicos.

# unityContent4UrlText1
source: Demonstration Video
es: Video Demostrativo

# unityContent4UrlText2
source: App in the Play Store
es: App en la Play Store

# unityContent4Image1Description
source: Simple interface, with variation of the central button with which you can take photos or videos of the application.
es: Tutorial simple con variación del botón central con el que se pueden hacer fotos o videos de la escena creada con objetos AR.

# unityContent4Image2Title
source: Category:
es: Detalle:

# unityContent4Image2Description
source: Preview of the detail of one of the categories to choose. They are 3D models with animations and some color variation.
es: Previsualización del detalle de una de las categorías a elegir. Son modelos 3d con animaciones y alguna variacion de color.

# unityContent4Image3Title
source: AR Scene:
es: Escena AR:

# unityContent4Image3Description
source: The user can choose from a large number of 3D objects and place them in the scene. You can rotate and resize them, or even move them along a route.
es: El usuario puede elegir entre una gran cantidad de objetos 3D y plasmarlos en la escena. Puede rotarlos,cambiarles el tamaño o incluso hacer que se muevan por un recorrido.

# unityContent3Title
source: · 2D and 3D mini-games with integration to real toys 2018 - 2023.
es: · Minijuegos 2D y 3D con integración a juguetes reales 2018 - 2023.

# unityContent3Subtitle
source: Several mini games created with the aim of integrating traditional toys (dolls, puzzles, drums...) with new technologies. It also allows to obtain valuable information from the user such as his mood, tastes or playing time.
es: Varios mini juegos creados con la finalidad de integrar los juguetes tradicionales (Muñecas, puzles, batería...) con las nuevas tecnologías. Además, permite obtener información valiosa del usuario como por ejemplo su estado de ánimo, gustos, tiempo de juego...

# unityContent3UrlText1
source: Dolls Game
es: Juego de Muñecas

# unityContent3UrlText2
source: Artificial Intelligence and traditional games
es: Inteligencia Artificial y los juegos tradicionales

# unityContent3Image1Title
source: Musical battle:
es: Batalla musical:

# unityContent3Image1Description
source: Program able to interpret the sound generated by the user with a toy battery and use it to hit the enemy.
es: Programa capaz de interpretar el sonido generado por el usuario con una batería de juguete y usarlo para golpear al enemigo.

# unityContent3Image2Title
source: Scenarios that come to life v1:
es: Escenarios que cobran vida 2D:

# unityContent3Image2Description
source: The user assembles a toy puzzle, focuses it and the puzzle is recreated in the 3D scenario.
es: El usuario monta un puzzle de juguete, lo enfoca y se recrea un escenario en 2D.

# unityContent3Image3Description
source: The user talks to the AI and the AI acts according to the interpreted emotions.
es: El usuario habla con la IA y esta, actúa en función de las emociones interpretadas.

# unityContent3Image4Title
source: Arcade Games:
es: Juegos Arcade:

# unityContent3Image4Description
source: Using Google AI, the app recognizes the toy and starts the mini game.
es: Mediante la IA de Google, reconoce el juguete y empieza el mini juego.

# unityContent3Image5Title
source: Cards:
es: Tarjetas:

# unityContent3Image5Description
source: The app recognizes the card and associates it with an emotion. The user, by focusing on the back of the card, must choose the face with the detected emotion.
es: Se reconoce e interpreta una tarjeta con una emoción. El usuario, al enfocar el reverso, debe de elegir la cara con la emoción detectada.

# unityContent3Image6Title
source: Playing with dolls:
es: Jugando con muñecas:

# unityContent3Image6Description
source: The user interacts with the doll in an augmented reality space. The app is only launched when the wrist is recognized.
es: El usuario interactúa con la muñeca en un espacio de realidad aumentada. Al app solo se lanza al reconocer la muñeca.

# unityContent3Image7Title
source: Scenarios that come to life in v2:
es: Escenarios que cobran vida 3D:

# unityContent3Image7Description
source: The user assembles a toy puzzle, focuses it, and the scenario is recreated in 3D.
es: El usuario monta un puzzle de juguete, enfoca el puzzle y se recrea el escenario en 3D.

# unityContent3Image8Title
source: Scenarios that come to life in v3:
es: Escenarios que cobran vida 3D:

# unityContent3Image8Description
source: Second part of the project, the user assembles a toy puzzle, focuses it, and the scenario is recreated in 3D.
es: Segunda parte del proyecto, el usuario monta un puzzle de juguete, enfoca el puzzle y se recrea el escenario en 3D.

# unityContent3Image9Title
source: Musical battle v2:
es: Batalla musical v2:

# unityContent3Image9Description
source: Mini game that allows you to calibrate a drum kit and play based on the recorded sound.
es: Mini juego que permite calibrar una batería y jugar en base al sonido registrado.

# unityContent2Title
source: · App AR Demostrator for SAMT Sudoe 2019
es: · App AR Demostrador para SAMT Sudoe 2019

# unityContent2Subtitle
source: The application allows interaction with demonstrators in the field of additive manufacturing. To do so, it uses augmented reality to identify the different demos and display information about them. This application was used in a demonstration event.
es: La aplicación permite interactuar con los demostradores del campo de la fabricación aditiva. Para ello, utiliza la realidad aumentada para identificar los distintos demostradores y mostrar información sobre ellos. Esta aplicación se usó en un evento demostrativo.

# unityContent2UrlText1
source: Video Conference
es: Video Conferencia

# unityContent2UrlText2
source: App in the Play Store
es: App en la Play Store

# unityContent2Tecnologies
source: Vuforia, MediaPlayer, Translations
es: Vuforia, MediaPlayer, Traducciones

# unityContent2Image1Title
source: Initial menu:
es: Menú inicial:

# unityContent2Image1Description
source: The app has augmented reality, links of interest and tutorials. It is also translated into 5 languages.
es: La app dispone de Realidad aumentada, enlaces de interes y tutoriales. Además está traducida a 5 idiomas.

# unityContent2Image2Title
source: Demonstrators:
es: Demostradores:

# unityContent2Image2Description
source: List of the demonstrators used by the company, each one with specific information, models and videos.
es: Los distintos demostradores usados por la empresa, cada uno dispone de información concreta, modelos, videos...
