Repository: SilviaCebrian/web_curriculum
Catalog: lib/l10n/app_*.arb
Languages: es

# unityContent2Image3Title
source: Example visualization:
es: Ejemplo visualización:

# unityContent2Image3Description
source: Microstructure of the impression of the chosen material, the user can rotate and view the structure.
es: Uno de los ejemplos de visualización, donde se aprecia la microestructura de la impresión del material elegido.

# unityContent1Title
source: · App AR Help for dependent people 2018
es: · App AR Ayuda a personas dependientes 2018

# unityContent1Subtitle
source: The application was developed with the aim of helping dependent people who need help in their daily lives. The app connected to an external database and alerted the patient of the time to take their medication or a medical appointment. In addition, if the medication was scanned with the device, the information associated with it was obtained, as well as the dose to be taken.
es: La aplicación se desarrolló con la finalidad de ayudar a personas dependientes que necesitan tomar medicación. La app se configuraba en una base de datos externa y avisaba al paciente de la hora de la toma. Además, si se escaneaba el medicamento con el dispositivo, se obtenía la información asociada a este asi como la dosis que debía de tomar.

# unityContent1UrlText1
source: Prezi of the app
es: Prezi de la app

# unityContent1Image1Title
source: Information:
es: Información:

# unityContent1Image1Description
source: Data obtained by identifying the medication container by vuforia. These data are obtained from a database, where the dose and time of the intake are collected.
es: Datos obtenidos al identificar mediante vuforia el envase de la medicación. Estos datos se obtienen de una base de datos, donde se recoge la dosis y la hora de la toma.

# unityContent1Image2Description
source: The application has an integrated tutorial so that the patient can understand how it works at all times.
es: La app, dispone de un tutorial integrado para que el paciente pueda entender en todo momento cómo funciona la app.

# unityContent1Image3Title
source: Notifications:
es: Notificaciones:

# unityContent1Image3Description
source: The user will receive notifications when a dose is due or when an important event occurs.
es: El usuario recibirá notificaciones cuando deba de tomar una dosis o tenga un evento importante.

# solidityContent1Title
source: · Fuguland Project 2021 - 2022.
es: · Proyecto Fuguland 2021 - Actualidad.

# solidityContent1Subtitle
source: Web browser based NFT game. I have created the Fuguland universe and its history, as well as the Blockchain part (Smart Contracts), the web part (React), the Whitepaper and the game dynamics.
es: Juego NFT basado en explorador web. El proyecto lo he empezado desde 0, creando el universo de Fuguland y su historia. Además de la parte de Blockchain (Smart Contracts), la parte web(React), el Whitepaper así como, las dinámicas del juego.

# solidityContent1Tecnologies
source: Ganache, Smart Contracts (NFTs, Coins, Game), React, Blockchain and Binance testnet.
es: Ganache, Smart Contracts (NFTs, Coins, Game), React, Blockchain y la testnet de Binance.

# solidityContent1Image1Description
source: hey are one of the NFTs in this game. They will travel the seabed and get juicy rewards in the token.
es: Son unos de los NFTs de este juego. Ellos viajarán por el fondo marino y obtendrán jugosas recompensas en el token.

# solidityContent1Image2Description
source: Presentation of the project, Tokenomics, game dynamics, NFTs burning, ROI, Presales, Roadmap ...
es: Presentación del proyecto, Tokenomics, dinámicas de juego, quema de NFTs, ROI, Presales, Roadmap ...

# solidityContent1Image3Description
source: Contato of the main NFT (Fugu), although the project has many more.
es: Contato del NFT estrella (Fugu), aunque el proyecto tiene muchos más.

# contactText
source: Contact
es: Contacto

# contactText2
source: If you are interested in my work or just want to talk about a project you can contact me at:
es: Si estás interesado en mis servicios o simplemente quieres hablar sobre algún proyecto puedes contactar conmigo en:

# contactAlternativeText
source: Or you can write me here
es: O puedes escribirme por aquí

# askName
source: What is your name?
es: ¿Cómo te llamas?

# nameText
source: Name
es: Nombre

# askEmail
source: ¿Cual es tu email?
es: ¿Cuál es tu email?

# messageText
source: Message
es: Mensaje

# emailSended
source: Email sent.
es: Email enviado.

# contactAction
source: Contact
es: Contactar

# formEmptyField
source: The field cannot be left empty.
es: No puede quedar el campo vacío.
